content/posts/rustification.org
#+title: A fresh begining with rust

#+draft: false
* Hoi..

** How did we get here....

----- 

So recently I was wondering what it'd be like to use Rust. IDK why....I just had the urge to try rust.

Then something weird happened. I saw a [[https://www.youtube.com/watch?v=dFkGNe4oaKk][No boilerplate video where they made a rust-only based command line envirorment.]] So zellij for the terminal multiplexer, Nu for the shell, Helix for the editor among many others. That made me wonder what the future of the command line would look like. So since then I had that thought in my head. Then two or three days later I got another video suggestion [[https://www.youtube.com/watch?v=br3GIIQeefY][for learning rust in a 10 minute video or so.]] That reignited the will to try out an all rust dev system. So that's how I ended up writing this....



** The challange:

For the next month I will limit myself to using as many rust based tools as possible. Such as helix for code editing, nu as the shell and things like that. I will also try to only code my projects in rust and try to learn rust in general. And the main thing I will try to do is to document as much of the project as possible and then publish it.

** The setup:

I'm on NixOS. I manage my config files via home manager. so every app was configured by it. The config is available on my github. I am using Nushell with the carapace backend/completion engine( IDK what to call it honestly... ) and starship as my prompt.

I am also using Kitty as my terminal and Helix as my editor with Gruvbox as the theme everywhere.... 



So uhhh....That's all for now I guess
:wave: 
