public/posts/rustification/index.html
<!DOCTYPE html>
<html lang=en>
    <head>
    <meta charset="utf-8" />  
    <meta name="viewport" content="width=device-width, initial-scale=1">

	<link rel="icon" type="image/svg" href="http://localhost:1313/ico/favicon.svg"><title>A fresh begining with rust - FKF&#39;s blog</title><meta name="description" content="Blog" />
	<meta name="keywords" content=", " />


	<link rel="preconnect" href="https://fonts.gstatic.com">
	<link href="https://fonts.googleapis.com/css2?family=Inconsolata&display=swap" rel="stylesheet">

	<link rel="stylesheet" type="text/css" media="screen" href="http://localhost:1313/css/main.css" />
	<link rel="stylesheet" type="text/css" media="screen" href="http://localhost:1313/css/syntax.css" />


	
  <meta name="twitter:card" content="summary">
  <meta name="twitter:title" content="A fresh begining with rust">
  <meta name="twitter:description" content="Hoi.. How did we get here…. So recently I was wondering what it&#39;d be like to use Rust. IDK why….I just had the urge to try rust.
Then something weird happened. I saw a No boilerplate video where they made a rust-only based command line envirorment. So zellij for the terminal multiplexer, Nu for the shell, Helix for the editor among many others. That made me wonder what the future of the command line would look like. So since then I had that thought in my head. Then two or three days later I got another video suggestion for learning rust in a 10 minute video or so. That reignited the will to try out an all rust dev system. So that&#39;s how I ended up writing this….">

	<meta property="og:url" content="http://localhost:1313/posts/rustification/">
  <meta property="og:site_name" content="FKF&#39;s blog">
  <meta property="og:title" content="A fresh begining with rust">
  <meta property="og:description" content="Hoi.. How did we get here…. So recently I was wondering what it&#39;d be like to use Rust. IDK why….I just had the urge to try rust.
Then something weird happened. I saw a No boilerplate video where they made a rust-only based command line envirorment. So zellij for the terminal multiplexer, Nu for the shell, Helix for the editor among many others. That made me wonder what the future of the command line would look like. So since then I had that thought in my head. Then two or three days later I got another video suggestion for learning rust in a 10 minute video or so. That reignited the will to try out an all rust dev system. So that&#39;s how I ended up writing this….">
  <meta property="og:locale" content="en">
  <meta property="og:type" content="article">
    <meta property="article:section" content="posts">
    <meta property="article:published_time" content="2024-12-12T00:00:00+00:00">
    <meta property="article:modified_time" content="2024-12-12T00:00:00+00:00">



	</head>

    <body>
    
        <div class="container">
            <header>
    <div>
        <h1 class="site-title"><a href="http://localhost:1313/">FKF&#39;s blog</a></h1>
        <div class="site-info"><nav class="social-nav">
                <ul class="flat"><li><a href="https://github.com/fruity-fkf" title="Github" target="_blank"><i data-feather="github"></i></a></li><li><a rel="alternate" type="application/rss+xml" href="http://localhost:1313/index.xml" title="FKF&#39;s blog"><i data-feather="rss"></i></a></li>
                </ul>
            </nav>
        </div>

        <nav>
            <ul class="flat">
                
                <li>
                    <a href="/posts">All Posts</a>
                </li>
                
                <li>
                    <a href="/about">About</a>
                </li>
                
            </ul>
        </nav>

    </div>
</header>

            <div class="content">

                <div>
                    <h1 class="single-title">A fresh begining with rust</h1>   
                    <p class="metadata"> Published - 2024-12-12 |  <i data-feather="clock" style="width: 12px; height: 12px;"></i> 1min </p>
                </div>

                

                <article class="markdown">
                    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Hoi..
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
How did we get here….
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<hr>
<p>
So recently I was wondering what it&#39;d be like to use Rust. IDK why….I just had the urge to try rust.</p>
<p>
Then something weird happened. I saw a <a href="https://www.youtube.com/watch?v=dFkGNe4oaKk">No boilerplate video where they made a rust-only based command line envirorment.</a> So zellij for the terminal multiplexer, Nu for the shell, Helix for the editor among many others. That made me wonder what the future of the command line would look like. So since then I had that thought in my head. Then two or three days later I got another video suggestion <a href="https://www.youtube.com/watch?v=br3GIIQeefY">for learning rust in a 10 minute video or so.</a> That reignited the will to try out an all rust dev system. So that&#39;s how I ended up writing this….</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
The challange:
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
For the next month I will limit myself to using as many rust based tools as possible. Such as helix for code editing, nu as the shell and things like that. I will also try to only code my projects in rust and try to learn rust in general. And the main thing I will try to do is to document as much of the project as possible and then publish it.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
The setup:
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
I&#39;m on NixOS. I manage my config files via home manager. so every app was configured by it. The config is available on my github. I am using Nushell with the carapace backend/completion engine( IDK what to call it honestly… ) and starship as my prompt.</p>
<p>
I am also using Kitty as my terminal and Helix as my editor with Gruvbox as the theme everywhere…. </p>
<p>
So uhhh….That&#39;s all for now I guess</p>
</div>
</div>
</div>
</div>

                </article>

                <div class="post-tags">
                    
                        
                    
                </div>

                <div>
                    
                        

<style>
#share-buttons {display: inline-block; vertical-align: middle; }
#share-buttons:after {content: ""; display: block; clear: both;}
#share-buttons > div {
position: relative;
text-align: left; 
height: 36px; 
width: 32px; 
float: left; 
text-align: center;
}
#share-buttons > div > svg {height: 16px; fill: #ebdbb2; margin-top: 10px;}
#share-buttons > div:hover {cursor: pointer;}
#share-buttons > div.facebook:hover > svg {fill: #3B5998;}
#share-buttons > div.twitter:hover > svg {fill: #55ACEE;}
#share-buttons > div.linkedin:hover > svg {fill: #0077b5;}
#share-buttons > div.pinterest:hover > svg {fill: #CB2027;}
#share-buttons > div.gplus:hover > svg {fill: #dd4b39;}
#share-buttons > div.mail:hover > svg {fill: #7D7D7D;}
#share-buttons > div.instagram:hover > svg {fill: #C73B92;}
#share-buttons > div.facebook > svg {height: 18px; margin-top: 9px;}
#share-buttons > div.twitter > svg {height: 20px; margin-top: 8px;}
#share-buttons > div.linkedin > svg {height: 19px; margin-top: 7px;}
#share-buttons > div.pinterest > svg {height: 20px; margin-top: 9px;}
#share-buttons > div.gplus > svg {height: 17px; margin-top: 9px; position: relative; left: 1px;}
#share-buttons > div.mail > svg {height: 14px; margin-top: 11px;}
</style>

<span style="color: #ebdbb2;">Share on: </span><div id="share-buttons">
<div class="facebook" title="Share this on Facebook" onclick="window.open('http://www.facebook.com/share.php?u=http:\/\/localhost:1313\/posts\/rustification\/');"><svg viewBox="0 0 1792 1792" xmlns="http://www.w3.org/2000/svg"><path d="M1343 12v264h-157q-86 0-116 36t-30 108v189h293l-39 296h-254v759h-306v-759h-255v-296h255v-218q0-186 104-288.5t277-102.5q147 0 228 12z"/></svg></div>
<div class="twitter" title="Share this on Twitter" onclick="window.open('https://twitter.com/intent/tweet?url=http:\/\/localhost:1313\/posts\/rustification\/');"><svg viewBox="0 0 1792 1792" xmlns="http://www.w3.org/2000/svg"><path d="M1684 408q-67 98-162 167 1 14 1 42 0 130-38 259.5t-115.5 248.5-184.5 210.5-258 146-323 54.5q-271 0-496-145 35 4 78 4 225 0 401-138-105-2-188-64.5t-114-159.5q33 5 61 5 43 0 85-11-112-23-185.5-111.5t-73.5-205.5v-4q68 38 146 41-66-44-105-115t-39-154q0-88 44-163 121 149 294.5 238.5t371.5 99.5q-8-38-8-74 0-134 94.5-228.5t228.5-94.5q140 0 236 102 109-21 205-78-37 115-142 178 93-10 186-50z"/></svg></div>
<div class="linkedin" title="Share this on Linkedin" onclick="window.open('https://www.linkedin.com/shareArticle?mini=true&url=http:\/\/localhost:1313\/posts\/rustification\/&title=&summary=&source=');"><svg viewBox="0 0 1792 1792" xmlns="http://www.w3.org/2000/svg"><path d="M477 625v991h-330v-991h330zm21-306q1 73-50.5 122t-135.5 49h-2q-82 0-132-49t-50-122q0-74 51.5-122.5t134.5-48.5 133 48.5 51 122.5zm1166 729v568h-329v-530q0-105-40.5-164.5t-126.5-59.5q-63 0-105.5 34.5t-63.5 85.5q-11 30-11 81v553h-329q2-399 2-647t-1-296l-1-48h329v144h-2q20-32 41-56t56.5-52 87-43.5 114.5-15.5q171 0 275 113.5t104 332.5z"/></svg></div>

<div class="mail" title="Share this through Email" onclick="window.open('mailto:?&body=http:\/\/localhost:1313\/posts\/rustification\/');"><svg viewBox="0 0 1792 1792" xmlns="http://www.w3.org/2000/svg"><path d="M1792 710v794q0 66-47 113t-113 47h-1472q-66 0-113-47t-47-113v-794q44 49 101 87 362 246 497 345 57 42 92.5 65.5t94.5 48 110 24.5h2q51 0 110-24.5t94.5-48 92.5-65.5q170-123 498-345 57-39 100-87zm0-294q0 79-49 151t-122 123q-376 261-468 325-10 7-42.5 30.5t-54 38-52 32.5-57.5 27-50 9h-2q-23 0-50-9t-57.5-27-52-32.5-54-38-42.5-30.5q-91-64-262-182.5t-205-142.5q-62-42-117-115.5t-55-136.5q0-78 41.5-130t118.5-52h1472q65 0 112.5 47t47.5 113z"/></svg></div>
</div>
                    
                </div>

                
                    
                

                
                    <style>
    .relatedcontainer {
        display: flex;
        flex-direction: row;
        flex-wrap: wrap;
        justify-content: space-evenly;
        align-items: stretch;
        margin-top: 0px;
    }

    .relateditem {  
        display: block;
        color: var(--fg);

        max-width: 30%;
        padding: 2%;
        height: auto;
        margin: 2%;

        box-shadow: 0 0.4rem 0.8rem 0 rgba(0,0,0,0.5);
        transition: 0.3s;
        border-radius: 0.5rem;
    }

    .relateditem:hover {
        background-color: var(--bg1);
        color: var(--fg);
    }   

    .relateditem p {
        text-overflow: ellipsis;
        margin: 0.5rem;
    }

    .relateditem h6 {
        font-size: 1.2rem;
        margin: 0.5rem;
        color: var(--red);
    }

    .related {
        border-top: 1px dashed var(--fg);
        margin-top: 2rem;
    }

    .related h5 {
        font-size: 1.6rem;
        margin-bottom: 1rem;
        margin-top: 1rem;
    }

    @media only screen and (max-width: 640px){
        .relateditem{
            min-width: 60%;
        }
    }

    @media only screen and (max-device-width: 640px){
        .relateditem{
            min-width: 60%;
        }
    }
</style>


                

                
            </div>
            <footer>
    <nav>
        <ul class="flat">
            <li>
                <div id="copyright"></div>
            </li>
            
            <li>
                [Built with <a href="https://gohugo.io">Hugo</a>]
            </li>
        </ul>
    </nav>
    <script>feather.replace()</script>
</footer>
        </div>
    </body>
</html>